docs/k6-results.txt 13-39-43-898.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/stroke-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 8 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 8 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-03-31T13:34:50+05:30" level=info msg="Registration skipped (403). Logging in..." source=console
time="2026-03-31T13:34:51+05:30" level=info msg="Setup complete — room: DGJLZW" source=console

running (0m01.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 8 VUs  0m00.6s/1m0s

running (0m02.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 8 VUs  0m01.6s/1m0s

running (0m03.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 8 VUs  0m02.6s/1m0s

running (0m04.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 8 VUs  0m03.6s/1m0s

running (0m05.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 8 VUs  0m04.6s/1m0s

running (0m06.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 8 VUs  0m05.6s/1m0s

running (0m07.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 8 VUs  0m06.6s/1m0s

running (0m08.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 8 VUs  0m07.6s/1m0s

running (0m09.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  14% ] 8 VUs  0m08.6s/1m0s

running (0m10.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 8 VUs  0m09.6s/1m0s

running (0m11.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 8 VUs  0m10.6s/1m0s

running (0m12.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  19% ] 8 VUs  0m11.6s/1m0s

running (0m13.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  21% ] 8 VUs  0m12.6s/1m0s

running (0m14.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 8 VUs  0m13.6s/1m0s

running (0m15.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  24% ] 8 VUs  0m14.6s/1m0s

running (0m16.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 8 VUs  0m15.6s/1m0s

running (0m17.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 8 VUs  0m16.6s/1m0s

running (0m18.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  29% ] 8 VUs  0m17.6s/1m0s

running (0m19.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 8 VUs  0m18.6s/1m0s

running (0m20.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 8 VUs  0m19.6s/1m0s

running (0m21.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  34% ] 8 VUs  0m20.6s/1m0s

running (0m22.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 8 VUs  0m21.6s/1m0s

running (0m23.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 8 VUs  0m22.6s/1m0s

running (0m24.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  39% ] 8 VUs  0m23.6s/1m0s

running (0m25.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  41% ] 8 VUs  0m24.6s/1m0s

running (0m26.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 8 VUs  0m25.6s/1m0s

running (0m27.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  44% ] 8 VUs  0m26.6s/1m0s

running (0m28.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 8 VUs  0m27.6s/1m0s

running (0m29.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  48% ] 8 VUs  0m28.6s/1m0s

running (0m30.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  49% ] 8 VUs  0m29.6s/1m0s

running (0m31.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  51% ] 8 VUs  0m30.6s/1m0s

running (0m32.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 8 VUs  0m31.6s/1m0s

running (0m33.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  54% ] 8 VUs  0m32.6s/1m0s

running (0m34.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 8 VUs  0m33.6s/1m0s

running (0m35.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  58% ] 8 VUs  0m34.6s/1m0s

running (0m36.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  59% ] 8 VUs  0m35.6s/1m0s

running (0m37.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  61% ] 8 VUs  0m36.6s/1m0s

running (0m38.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 8 VUs  0m37.6s/1m0s

running (0m39.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  64% ] 8 VUs  0m38.6s/1m0s

running (0m40.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  66% ] 8 VUs  0m39.6s/1m0s

running (0m41.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  68% ] 8 VUs  0m40.6s/1m0s

running (0m42.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  69% ] 8 VUs  0m41.6s/1m0s

running (0m43.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  71% ] 8 VUs  0m42.6s/1m0s

running (0m44.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  73% ] 8 VUs  0m43.6s/1m0s

running (0m45.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  74% ] 8 VUs  0m44.6s/1m0s

running (0m46.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  76% ] 8 VUs  0m45.6s/1m0s

running (0m47.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  78% ] 8 VUs  0m46.6s/1m0s

running (0m48.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  79% ] 8 VUs  0m47.6s/1m0s

running (0m49.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  81% ] 8 VUs  0m48.6s/1m0s

running (0m50.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  83% ] 8 VUs  0m49.6s/1m0s

running (0m51.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  84% ] 8 VUs  0m50.6s/1m0s

running (0m52.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  86% ] 8 VUs  0m51.6s/1m0s

running (0m53.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  88% ] 8 VUs  0m52.6s/1m0s

running (0m54.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  89% ] 8 VUs  0m53.6s/1m0s

running (0m55.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  91% ] 8 VUs  0m54.6s/1m0s

running (0m56.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  93% ] 8 VUs  0m55.6s/1m0s

running (0m57.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  94% ] 8 VUs  0m56.6s/1m0s

running (0m58.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  96% ] 8 VUs  0m57.6s/1m0s

running (0m59.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [  98% ] 8 VUs  0m58.6s/1m0s

running (1m00.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [  99% ] 8 VUs  0m59.6s/1m0s

running (1m01.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m02.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m03.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m04.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m05.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m06.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m07.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m08.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m09.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m10.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m11.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m12.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m13.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m14.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m15.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m16.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m17.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m18.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m19.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m20.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m21.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m22.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m23.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m24.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m25.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m26.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m27.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m28.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m29.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m30.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate < 0.01' rate=33.33%

    stroke_latency_ms
    ✓ 'p(99) < 200' p(99)=1

    ws_connect_errors
    ✓ 'count < 3' count=0


  █ TOTAL RESULTS 

    checks_total.......: 8       0.088466/s
    checks_succeeded...: 100.00% 8 out of 8
    checks_failed......: 0.00%   0 out of 8

    ✓ WS connected

    CUSTOM
    stroke_latency_ms..............: avg=0.210351 min=0       med=0        max=18       p(90)=1        p(95)=1       
    strokes_sent...................: 7188   79.486587/s

    HTTP
    http_req_duration..............: avg=141.58ms min=30.48ms med=90.68ms  max=303.58ms p(90)=261ms    p(95)=282.29ms
      { expected_response:true }...: avg=167.03ms min=30.48ms med=167.03ms max=303.58ms p(90)=276.27ms p(95)=289.93ms
    http_req_failed................: 33.33% 1 out of 3
    http_reqs......................: 3      0.033175/s

    EXECUTION
    iteration_duration.............: avg=58.02s   min=58.02s  med=58.02s   max=58.02s   p(90)=58.02s   p(95)=58.02s  
    iterations.....................: 8      0.088466/s
    vus............................: 8      min=8        max=8
    vus_max........................: 8      min=8        max=8

    NETWORK
    data_received..................: 23 MB  250 kB/s
    data_sent......................: 2.2 MB 24 kB/s

    WEBSOCKET
    ws_connect_errors..............: 0      0/s
    ws_connecting..................: avg=14.38ms  min=10.73ms med=13.55ms  max=20.19ms  p(90)=18.84ms  p(95)=19.88ms 
    ws_msgs_received...............: 57489  635.726826/s
    ws_msgs_sent...................: 7220   79.840451/s
    ws_session_duration............: avg=58.02s   min=58.01s  med=58.02s   max=58.02s   p(90)=58.02s   p(95)=58.02s  
    ws_sessions....................: 16     0.176932/s



running (1m30.4s), 0/8 VUs, 8 complete and 8 interrupted iterations
default ✓ [ 100% ] 8 VUs  1m0s
time="2026-03-31T13:36:21+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"